<?php

use Illuminate\Database\Seeder;

class WhatnewsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('whatnews')->delete();
        
        \DB::table('whatnews')->insert(array (
            0 => 
            array (
                'id' => 2,
                'title' => 'ហេតុផល ៤ បង្ហាញ​ថា Laptop ធម្មតាជាជម្រើសល្អ​​ជាង Mac ​សម្រាប់​ការ​កាត់​​ត​',
                'description' => 'អ្នក​ដែល​ចង់​ទិញ​កុំព្យូទ័រ​យួរ​ដៃ​សម្រាប់​រៀន​កាត់​ត​វីដេអូ ឬ រូបភាព​ប្រហែល​ជា​មិន​ទាន់​សម្រេច​ចិត្ត​បាន​នៅ​ឡើយ​ទេ​ថា​គួរ​ទិញ​កុំព្យូទ័រ​ដើរ​ដោយ​ Windows ធម្មតា​ ឬ ទិញ​ពពួក MacBook របស់​ Apple នោះ។ ត​ទៅ​នេះ​នឹង​ប្រាប់​​ពី​ហេតុផល​ ៤ ដែល​បង្ហាញ​ថា​កុំព្យូទ័រ​យួរ​ដៃ​ធម្មតា​ ជា​ជម្រើស​ល្អ​ជាង MacBook សម្រាប់​ការ​កាត់​ត​វីដេអូ ឬ រូបភាព៖

១. តម្លៃ

បើ​មើល​លើ​កុំព្យូទ័រ​ធម្មតា​ដូច​ជា​ Dell XPS 15 ជា​ដើម​មាន​សមត្ថភាព​ប្រហាក់ប្រហែល​នឹង​ MacBook Pro ប៉ុន្តែ​តម្លៃ​របស់​វា​ថោក​ជាង​ MacBook Pro ដល់​ទៅ ១ ០០០ ដុល្លារ​ឯណោះ។

២. រន្ធ​ដោត

ទោះ​បី​ជា MacBook Pro ​មាន​តម្លៃ​ថ្លៃ​ជាង​ ១ ០០០ ដុល្លារ​មែន​ ប៉ុន្តែ​អ្នក​ត្រូវ​ចំណាយ​លុយ​បន្ថែម​លើ​ការ​ទិញ​ឌុយ​សម្រាប់​ត​ភ្ជាប់​បន្ថែម​ដោយ​សារ​វា​មិន​មាន​រន្ធ​សម្រាប់​ដោត​មេមូរី​កាត​ដែល​ជា​រន្ធ​ដ៏​សំខាន់​មួយ ​និង មិន​មាន​រន្ធ​អ្វី​ផ្សេង​ទៀត​ក្រៅ​ពី​រន្ធ​ Thunderbolt 3 ចំនួន​ ៤ នោះ​ទេ។

៣. អាច​ដំឡើង​ម៉ាស៊ីន​ឲ្យ​ខ្លាំង​បាន

នៅ​លើ​កុំព្យូទ័រ Windows បើ​ចង់​ដំឡើង​លក្ខណៈ​សម្បត្តិ​ម៉ាស៊ីន​ឲ្យ​ខ្លាំង​គឺ​ជា​រឿង​ងាយ​ស្រួល ហើយ​ចំណាយ​ប្រាក់​អស់​មិន​ច្រើន​ឡើយ។ ដោយ​ឡែក​ចំពោះ​ MacBook វិញ​គឺ​ចំណាយ​ប្រាក់​អស់​ច្រើន​ ហើយ​ពិបាក​នឹង​ប្ដូរ​គ្រឿង​ទៀត​ ជា​ពិសេស​ MacBook ស៊េរី​ថ្មី​ព្រោះ​ថា​ Processor, RAM, SSD សុទ្ធ​តែ​បាន​ផ្សា​ភ្ជាប់​នឹង​ Motherboard។

៤. អេក្រង់ Touch

កុំព្យូទ័រ​ Windows ភាគ​ច្រើន​មាន​​អេក្រង់​សមត្ថភាព​ពិសេស​ដែល​​អាច​បញ្ជា​តាម​រយៈ​ម្រាម​ដៃ​បាន ប៉ុន្តែ​ចំណុច​ពិសេស​នេះ​គេ​នៅ​មិន​ទាន់​ឃើញ​មាន​នៅ​លើ​ MacBook នៅ​ឡើយ​ទេ។ ទោះ​បី​ជា​ MacBook ស៊េរី​ថ្មី​មាន​ខ្សែ​ Touch មួយ​ជួរ​មែន ប៉ុន្តែ​មិន​មាន​សមត្ថភាព​ពេញ​លេញ​ដូច​អេក្រង់ Touch ឡើយ។

​​​​​​​​ ត្បិត​ថា​ចំណុច​ ៤ ខាង​លើ​​កុំព្យូទ័រ​យួរ​ដៃ​ធម្មតា​មាន​ប្រៀប​ជាង MacBook មែន​ ប៉ុន្តែ​​ MacBook របស់​ Apple មាន​ចំណុច​​ខ្លាំង​មួយ​ដែល​គេ​ទទួល​ស្គាល់​នោះ​គឺ​ម៉ាស៊ីន​មិន​សូវ​ជួប​បញ្ហា​ច្រើន​ដូច​ជា​កុំព្យូទ័រ​ដើរ​ដោយ​ Windows នោះ​ទេ។ ដូច​នេះ​ប្រសិន​បើ​អ្នក​មាន​ថវិកា​គ្រប់​គ្រាន់​ហើយ​មិន​ចង់​ប្រើ​កុំព្យូទ័រ​ដែល​ឧស្សាហ៍​ជួប​បញ្ហា​គួរ​យក​ MacBook ប៉ុន្តែ​បើ​សិន​ថវិកា​មិន​គ្រប់គ្រាន់​ទេ​អាច​ប្រើ​ត្រឹម​កុំព្យូទ័រ Windows ក៏​បាន​ដែរ៕​​

ចុចអាន៖

តិចនិច​​ធ្វើ​ឲ្យ​ផ្ទៃ​អេក្រង់​ ចេញ​រូប​ពស់​វា​ពេញហ្វេសបុក ការពិត​គេ​ធ្វើ​ចឹង​សោះ!

មក​ស្គាល់​​កំពូលកម្មវិធី​កម្ចាត់មេរោគ​ទាំង ៥ លើ​កុំព្យូទ័រ​',
                'option' => '{"lang":{"kh":"\\u17a0\\u17c1\\u178f\\u17bb\\u1795\\u179b \\u17e4"}}',
                'image_url' => '20677_1500453029.jpg',
                'video_url' => 'https://www.youtube.com/',
                'status' => 1,
                'created_at' => '2017-07-19 01:29:02',
                'updated_at' => '2017-07-19 01:30:30',
            ),
            1 => 
            array (
                'id' => 3,
                'title' => 'ចេញ​ហើយ! USB 3.2​ ​ល្បឿន​ ​២០​ ​Gbps',
                'description' => 'ទើប​ប្រកាស​ ​ប៉ុន្តែ​ក្រុម​អ្នក​អភិវឌ្ឍ​បង្ហាញ​ ​នឹង​​ចេញ​​ផ្លូវការ​នា​ខែ​កញ្ញា​ ​២០១៧​ ​ហើយ​បច្ចេកវិទ្យា​ចម្លង​ទិន្នន័យ​ដ៏​លឿន​នេះ​ ​និង​បំពាក់​ក្នុង​ក្បាល​​ចម្លង​ទិន្នន័យ​ប្រភេទ​ ​USB-C។ ដោយ​ឡែក​ ​បច្ចេកវិទ្យា​ ​USB 3.1​ ​ដែល​ចម្លង​ទិន្នន័យ​ដល់​ ​២០​ ​Gbps​ ​នេះ​ ​គឺ​នឹង​ដាក់​ឲ្យ​ប្រើប្រាស់​ជា​សាធារណៈ​តាម​គ្រឿង​អេឡិចត្រូនិក​នានា​ចាប់​ពី​ឆ្នាំ​ ​២០១៩។

​បច្ចេកវិទ្យា​ចម្លង​ទិន្នន័យ​ ​USB​ ​នេះ​ ​មាន​បែង​ចែក​ជា​ ​៤​ ​ប្រភេទ​ ​គឺ​ ​៖

USB​ ​មាន​ល្បឿន​ ​១២​ ​Mbps
USB​ ​HI-SPEED​ ​មាន​ល្បឿន​ ​៤៨០​ ​Mbps
USB​ ​SUPERSPEED+​ ​មាន​ល្បឿន​ ​១០​ ​Gbps
USB​ ​SUPERSPEED++​ ​មាន​ល្បឿន​ ​២០​ ​Gbps',
                'option' => '{"lang":{"kh":"\\u1785\\u17c1\\u1789\\u200b\\u17a0\\u17be\\u1799! USB 3.2\\u200b \\u200b\\u179b\\u17d2\\u1794\\u17bf\\u1793\\u200b \\u200b\\u17e2\\u17e0\\u200b \\u200bGbps"}}',
                'image_url' => '54915_1501146737.png',
                'video_url' => NULL,
                'status' => 1,
                'created_at' => '2017-07-27 02:12:18',
                'updated_at' => '2017-07-27 02:12:18',
            ),
            2 => 
            array (
                'id' => 4,
                'title' => 'ឧបករណ៍​សាក​ថ្ម​ទូរសព្ទ​ដោយ​ពន្លឺ​ព្រះអាទិត្យ​ ល្អ​ៗ​ចំនួន​ ៦',
                'description' => 'សុបិន​អាក្រក់​របស់​អ្នក​ប្រើ​ស្មាតហ្វូន ឬ Tablet ​គឺ​រឿង​អស់​ថ្ម​​តែ​មួយ​ប៉ុណ្ណោះ ហើយ​អាក្រក់​ជាង​នេះ​ទៅ​ទៀត​នោះ​ពេល​ដែល​មិន​មាន​​កន្លែង​សម្រាប់​សាក​ថ្ម​នៅ​ជិត​ខ្លួន។ ប៉ុន្តែ​នៅ​ជុំវិញ​ខ្លួន​យើង​មាន​ព្រះអាទិត្យ​ដែល​ជា​​ថាមពល​ធម្មជាតិ​ដ៏​ល្អ​មួយ អាច​ប្រើ​សម្រាប់​សាក​ថ្ម​ស្មាតហ្វូន​បាន​តាម​រយៈ​​ឧបករណ៍​សាក​ថ្ម​ទូរសព្ទ​ដោយ​ពន្លឺ​ព្រះអាទិត្យ។ ត​ទៅ​នេះ​នឹង​បង្ហាញ​ពី​ជម្រើស​ឧបករណ៍​សាក​ថ្ម​​ល្អ​ៗ​ចំនួន​ ៦៖

១. Solartab (តម្លៃ​​នៅ​បរទេស​ ៩៩ ដុល្លារ)

#បរិមាណ​​ផ្ទុក ៖ ១៣០០០ mAh

#ប្រភព​បញ្ចេញ ៖ រន្ធ​ USB ចំនួន​ ២ អាច​ចម្លង​ថាមពល​បាន​ ២,១ A

#ទម្ងន់ ៖ ១,២ គីឡូក្រាម

#ផ្ទាំង​សូឡារ ៖ ថាមពល​ ៥,៥ វ៉ាត់​

​​​​​​​​​Solartab មិន​ត្រឹម​តែ​​អាច​សាក​ថ្ម​ទូរសព្ទ​ដោយ​ប្រើ​ថាមពល​ព្រះអាទិត្យ​ប៉ុណ្ណោះ​ទេ ប៉ុន្តែ​ថែម​ទាំង​អាច​រក្សា​ទុក​ថាមពល​ព្រះអាទិត្យ​បាន​ដល់​ ១៣០០០ mAh សម្រាប់​សាក​នៅ​ពេល​ក្រោយ​បាន​ទៀត​ផង។ ឧបករណ៍​នេះ​មាន​ជើង​សម្រាប់​​ទ្រ ដូច​នេះ​អ្នក​អាច​បង្វែរ​ទិស​ដៅ​ផ្ទាំង​សូឡារ​ឲ្យ​ចំ​កម្ដៅ​ព្រះអាទិត្យ​បាន​ពេញៗ។ អ្នក​អាច​ប្រើ​ឧបករណ៍​នេះ​ដើម្បី​សាក​បំពេញ​ថ្ម​ iPhone ក្នុង​ពេល​​ប្រមាណ​ ៩០ នាទី។

២. Voltaic Systems Amp (តម្លៃ​​នៅ​បរទេស​ ៩៩ ដុល្លារ)

#​បរិមាណ​​ផ្ទុក ៖ ៤០០០ mAh

#ប្រភព​បញ្ចេញ ៖ រន្ធ​ USB ចំនួន​ ១ អាច​ចម្លង​ថាមពល​បាន​ ១ A

#ទម្ងន់ ៖ ៤៨០ ក្រាម​

#ផ្ទាំង​សូឡារ ៖ ថាមពល​ ៤ វ៉ាត់

ឧបករណ៍​នេះ​អាច​ស្រូប​ថាមពល​ព្រះអាទិត្យ​បាន​ពេញ​ក្នុង​ពេល​ ៦ ម៉ោង ហើយ​ចំណាយ​ពេល​ ៤ ម៉ោង​ឯណោះ​ដើម្បី​សាក​បំពេញ​ថ្ម​ស្មាតហ្វូន​មួយ។ ចំណុច​ពិសេស​របស់​វា​គឺ​មាន​សម្បក​ការពារ​ដែល​អាច​ធន់​នឹង​ទឹក។ មិន​តែ​ប៉ុណ្ណោះ​ក៏​មាន​មុខងារ​បង្ការ​មួយ​ដែល​នឹង​បិទ​ដំណើរ​ការ​ថ្ម​ប្រសិន​បើ​ឡើង​កម្ដៅ​ក្ដៅ​ខ្លាំង។

៣. JOOS Orange (តម្លៃ​​នៅ​បរទេស​ ១៥០ ដុល្លារ)

#បរិមាណ​​ផ្ទុក ៖ ៥៤០០ mAh

#ប្រភព​បញ្ចេញ ៖ រន្ធ​ USB ចំនួន​ ១ អាច​ចម្លង​ថាមពល​បាន​ ១ A

#ទម្ងន់ ៖ ៦៨០ ក្រាម​

#ផ្ទាំង​សូឡារ ៖ ថាមពល​ ២,៤ វ៉ាត់

តម្លៃ​រាង​ថ្លៃ​បន្តិច​ នេះ​ក៏​ដោយ​សារ​តែ​វា​មាន​ភាព​រឹងមាំ​​អាច​ទប់​ស្កាត់​ការ​ប្រេះ​បែក​​ពេល​ដែល​ធ្លាក់​ក្នុង​ហេតុការណ៍​ចៃដន្យ​ណា​មួយ។ ចំណុច​ពិសេស​មួយ​ទៀត​គឺ​​ធន់​នឹង​ទឹក ហើយ​អាច​សាក​ថ្ម​ក្នុង​ទឹក​បាន​ទៀត។

៤. Yolk Station Solar Paper (តម្លៃ​​នៅ​បរទេស​ ១២៣ ដុល្លារ)

#បរិមាណ​​ផ្ទុក ៖ មិនមាន​

#ប្រភព​បញ្ចេញ ៖ រន្ធ​ USB ចំនួន​ ១ អាច​ចម្លង​ថាមពល​បាន​ ១ A

#ទម្ងន់ ៖ ១១៣ ក្រាម​

#ផ្ទាំង​សូឡារ ៖ ថាមពល​ ៥ វ៉ាត់

ជា​ឧបករណ៍​សាក​មាន​ទម្ងន់​ស្រាល​ជាង​គេ​បំផុត និង មាន​កម្រាស់​ត្រឹម​ ១១,៤៣ ម.ម ប៉ុណ្ណោះ។ ដោយ​សារ​តែ​មិន​មាន​ថ្ម​សម្រាប់​ផ្ទុក​ថាមពល​ ក៏​ជា​ចំណុច​ដែល​ធ្វើ​ឲ្យ​វា​​អាច​អាយុ​កាល​វែង​ដែរ។

៥. Anker PowerPort Solar (តម្លៃ​​នៅ​បរទេស​ ៦០ ដុល្លារ)

#​បរិមាណ​​ផ្ទុក ៖ មិនមាន​

#ប្រភព​បញ្ចេញ ៖ រន្ធ​ USB ចំនួន​ ១ អាច​ចម្លង​ថាមពល​បាន​​ដល់​ ៣ A

#ទម្ងន់ ៖ ៤១៦ ក្រាម​

#ផ្ទាំង​សូឡារ ៖ ថាមពល​ ២១ វ៉ាត់

ដោយ​សារ​តែ​មិន​មាន​ថ្ម​ ហេតុ​នេះ​ទើប​ឧបករណ៍​នេះ​មាន​ថាមពល​ច្រើន​ដល់​ ២១ វ៉ាត់ ដែល​អាច​ឲ្យ​សាក​ឧបករណ៍​អេឡិចត្រូនិក​ដទៃ​ទៀត​បាន​លឿន​បំផុត។ ឧបករណ៍​នេះ​មាន​មុខងារ​មួយ​ឈ្មោះ​ថា​ PowerIQ អាច​សម្រួល​នូវ​​កម្រិត​​អំពែ​នៃ​ថាមពល​​ដើម្បី​ឲ្យ​ស៊ី​គ្នា​នឹង​ឧបករណ៍​របស់​អ្នក ដើម្បី​ធានា​ថា​អាច​សាក​ថ្ម​បាន​លឿន​ និង មាន​សុវត្ថិភាព។

៦. SLXTREME Waterproof (តម្លៃ​​នៅ​បរទេស​ ១៥០ ដុល្លារ)

#​បរិមាណ​​ផ្ទុក ៖ ៣០០០ mAh​

#ប្រភព​បញ្ចេញ ៖ ភ្ជាប់​ទៅ​ទូរសព្ទ​ផ្ទាល់​

#ទម្ងន់ ៖ ៤១៦ ក្រាម​

#ផ្ទាំង​សូឡារ ៖ មិន​បញ្ជាក់

ចង់​បាន​សម្បក​ការពារ​ទូរសព្ទ​ដែល​អាច​សាក​ថ្ម​បាន​មែន? អា​ហ្នឹង​ក៏​មាន​ដែរ​ ដោយ​​អាច​ប្រើ​បាន​ជា​មួយ​ iPhone 5, 5s, 6 និង iPhone 6s។ ផ្ទាំង​សូឡារ​បាន​បំពាក់​នៅ​លើ​សម្បក​ការពារ​ផ្ទាល់ រួម​ជា​មួយ​នឹង​ថ្ម​ដែល​អាច​ផ្ទុក​ថាមពល​បាន​ ៣០០០ mAh។ ដូច​នេះ​អ្នក​អាច​សាក​ថ្ម​ទូរសព្ទ​បាន​ងាយ​ស្រួល​បំផុត​ ដោយ​គ្រាន់​តែ​ផ្គាប់​មុខ​ទូរសព្ទ៕​​

ចុចអាន៖

វិធី​ប្រើប្រាស់​ ​WhatsApp​ ​ឲ្យ​បាន​ពេញលេញ​នៅ​លើ​ ​iPad

ចង់​បញ្ជា​កាមេរ៉ា​ឲ្យ​បាន​ល្អ​ ​គួរ​យល់​ពី​ប៊ូតុង​ទាំង​នេះ


ប្រភព៖ DigitalTrends ប្រែ​សម្រួល៖ សុខហេង',
                'option' => '{"lang":{"kh":"\\u17a7\\u1794\\u1780\\u179a\\u178e\\u17cd\\u200b\\u179f\\u17b6\\u1780\\u200b\\u1790\\u17d2\\u1798\\u200b\\u1791\\u17bc\\u179a\\u179f\\u1796\\u17d2\\u1791\\u200b\\u178a\\u17c4\\u1799\\u200b\\u1796\\u1793\\u17d2\\u179b\\u17ba\\u200b\\u1796\\u17d2\\u179a\\u17c7\\u17a2\\u17b6\\u1791\\u17b7\\u178f\\u17d2\\u1799\\u200b \\u179b\\u17d2\\u17a2\\u200b\\u17d7\\u200b\\u1785\\u17c6\\u1793\\u17bd\\u1793\\u200b \\u17e6"}}',
                'image_url' => '47236_1501146818.jpg',
                'video_url' => NULL,
                'status' => 1,
                'created_at' => '2017-07-27 02:13:39',
                'updated_at' => '2017-07-27 02:13:39',
            ),
        ));
        
        
    }
}